//By GER.Cmd.buildgcc   CreateDate:2008-4-28 16:08:40
#include "LocalIncludeFile.h"

/********************************************************************************************
*紧急车数据表   结构体对应数据库中MsgEM表
********************************************************************************************/
 struct  MSG_MSGEM MsgMsgEM;
void InitMsgMsgEM(void)
{	
	memset((char *)&MsgMsgEM,'0',sizeof(struct MSG_MSGEM));	
}

/********************************************************************************************
*获取MsgMsgEM的地址
********************************************************************************************/
struct MSG_MSGEM *GetMsgMsgEM(void)
{	
	return (struct MSG_MSGEM  *)&MsgMsgEM;
}


/********************************************************************************************
*设置   车辆检测器检测故障时，用栏杆键强制落杠时置为1
********************************************************************************************/
void SetMsgEMMsgDetectorError(char InputDetectorError)
{	
	MsgMsgEM.DetectorError=InputDetectorError;
}

/********************************************************************************************
*备注
********************************************************************************************/
void SetMsgEMMsgMARK(char InputMARK)
{	
	MsgMsgEM.MARK=InputMARK;
}

//end_MsgEM
